Repository: Mohamedislam19/Sellefli
Catalog: l10n/app_*.arb
Languages: ar, fr

# itemDepositLabel
source: Deposit Required
ar: مبلغ التأمين
fr: Dépôt requis

# itemDepositHint
source: e.g., 50 DA (refundable)
ar: مثال: 50 دج (قابل للاسترداد)
fr: ex. 50 DA (remboursable)

# itemAvailableFrom
source: Available From
ar: متاح من
fr: Disponible à partir du

# itemAvailableUntil
source: Available Until
ar: متاح حتى
fr: Disponible jusqu'au

# itemDateHint
source: MM/DD/YYYY
ar: يوم/شهر/سنة
fr: JJ/MM/AAAA

# itemLocationLabel
source: Location
ar: الموقع
fr: Localisation

# itemLocationHint
source: Pick on map
ar: اختر من الخريطة
fr: Choisir sur la carte

# itemLocationRequired
source: Location is required.
ar: الموقع مطلوب.
fr: La localisation est requise.

# itemPublishButton
source: Publish Item
ar: نشر العنصر
fr: Publier l'article

# itemEditButton
source: Edit Item
ar: تعديل العنصر
fr: Modifier l'article

# itemCreateSuccess
source: Item published successfully.
ar: تم نشر العنصر بنجاح.
fr: Article publié avec succès.

# itemCreateError
source: Error: Item could not be published. {error}
ar: خطأ: تعذر نشر العنصر. {error}
fr: Erreur : l'article n'a pas pu être publié. {error}

# itemEditSuccess
source: Item updated successfully.
ar: تم تحديث العنصر بنجاح.
fr: Article mis à jour avec succès.

# itemLoadError
source: Item not loaded yet.
ar: لم يتم تحميل العنصر بعد.
fr: Article non encore chargé.

# itemSignInRequired
source: You must be signed in to create items.
ar: يجب تسجيل الدخول لإنشاء العناصر.
fr: Vous devez être connecté pour créer des articles.

# itemRequiredField
source: Required
ar: إلزامي
fr: Obligatoire

# itemDetailsTitle
source: Item Details
ar: تفاصيل العنصر
fr: Détails de l'article

# itemDetailsNoId
source: Error: No item ID provided
ar: خطأ: لم يتم تقديم معرف العنصر
fr: Erreur : aucun ID d'article fourni

# itemDetailsGoBack
source: Go Back
ar: عودة
fr: Retour

# itemDetailsNoDescription
source: No description available
ar: لا يوجد وصف
fr: Aucune description disponible

# itemDetailsCategory
source: Category
ar: الفئة
fr: Catégorie

# itemDetailsValue
source: Item Value
ar: قيمة العنصر
fr: Valeur de l'article

# itemDetailsDeposit
source: Deposit Required
ar: مبلغ التأمين
fr: Dépôt requis

# itemDetailsAvailableFrom
source: Available From
ar: متاح من
fr: Disponible à partir du

# itemDetailsAvailableUntil
source: Available Until
ar: متاح حتى
fr: Disponible jusqu'au

# itemDetailsStatus
source: Status
ar: الحالة
fr: Statut

# itemStatusAvailable
source: Available
ar: متاح
fr: Disponible

# itemStatusUnavailable
source: Unavailable
ar: غير متاح
fr: Indisponible

# itemDetailsOwner
source: Owner
ar: المالك
fr: Propriétaire

# itemDetailsOwnerReviews
source: ({count} reviews)
ar: ({count} تقييم)
fr: ({count} avis)

# itemDetailsDepositNote
source: Please refer to the Deposit Policy for more information on item rentals and returns.
ar: يرجى الرجوع إلى سياسة التأمين لمزيد من المعلومات حول الإيجار والإرجاع.
fr: Veuillez consulter la politique de dépôt pour plus d'informations sur les locations et retours.

# itemDetailsBookNow
source: Book Now
ar: احجز الآن
fr: Réserver

# itemDetailsNotAvailable
source: Not Available
ar: غير متاح
fr: Indisponible

# bookingDialogTitle
source: Booking Details
ar: تفاصيل الحجز
fr: Détails de la réservation

# bookingDialogStartDate
source: Start Date
ar: تاريخ البدء
fr: Date de début

# bookingDialogEndDate
source: End Date
ar: تاريخ الانتهاء
fr: Date de fin

# bookingDialogTotalCost
source: Total Cost
ar: التكلفة الإجمالية
fr: Coût total

# bookingDialogDays
source: Days
ar: الأيام
fr: Jours

# bookingDialogSelectDate
source: Select date
ar: اختر تاريخًا
fr: Sélectionner une date

# bookingDialogCancel
source: Cancel
ar: إلغاء
fr: Annuler

# bookingDialogConfirm
source: Confirm
ar: تأكيد
fr: Confirmer

# bookingDialogSuccess
source: Booking confirmed for {days} days!
ar: تم تأكيد الحجز لمدة {days} يومًا!
fr: Réservation confirmée pour {days} jours !

# bookingDialogFail
source: Failed to create booking: {error}
ar: فشل إنشاء الحجز: {error}
fr: Impossible de créer la réservation : {error}

# bookingDialogAuthRequired
source: User not authenticated
ar: المستخدم غير مصدق
fr: Utilisateur non authentifié

# requestsTitle
source: Requests & Orders
ar: الطلبات والطلبيات
fr: Demandes & Commandes

# requestsIncomingTab
source: Incoming
ar: الواردة
fr: Entrantes

# requestsMyRequestsTab
source: My Requests
ar: طلباتي
fr: Mes demandes

# requestsError
source: Error: {error}
ar: خطأ: {error}
fr: Erreur : {error}

# requestsNoIncoming
source: No incoming requests
ar: لا توجد طلبات واردة
fr: Aucune demande entrante

# requestsNoSent
source: No requests sent yet
ar: لا توجد طلبات مرسلة
fr: Aucune demande envoyée

# requestsFromSender
source: From {sender}
ar: من {sender}
fr: De {sender}

# requestsAccept
source: Accept
ar: قبول
fr: Accepter

# requestsDecline
source: Decline
ar: رفض
fr: Refuser

# bookingDetailsTitle
source: Booking Details
ar: تفاصيل الحجز
fr: Détails de la réservation

# bookingDetailsError
source: Error: {error}
ar: خطأ: {error}
fr: Erreur : {error}

# bookingDetailsNoData
source: No booking data
ar: لا توجد بيانات حجز
fr: Aucune donnée de réservation

# bookingSummaryTitle
source: Item & Booking Summary
ar: ملخص العنصر والحجز
fr: Résumé de l'article et de la réservation

# bookingBorrowedBy
source: Borrowed by: {user}
ar: مستعار من: {user}
fr: Emprunté par : {user}

# bookingTotalCostLabel
source: Total Cost:
ar: التكلفة الإجمالية:
fr: Coût total :

# bookingDepositLabel
source: Deposit:
ar: التأمين:
fr: Dépôt :

# bookingStatusLabel
source: Booking Status
ar: حالة الحجز
fr: Statut de la réservation

# bookingCodeLabel
source: Booking Code:
ar: رمز الحجز:
fr: Code de réservation :

# bookingOwnerActions
source: Owner Actions
ar: إجراءات المالك
fr: Actions du propriétaire

# bookingOwnerInformation
source: Owner Information
ar: معلومات المالك
fr: Informations sur le propriétaire

# bookingUnknownOwner
source: Unknown Owner
ar: مالك غير معروف
fr: Propriétaire inconnu

# bookingMarkDepositReceived
source: Mark Deposit Received
ar: تحديد التأمين كمستلم
fr: Marquer le dépôt reçu

# bookingMarkDepositReturned
source: Mark Deposit as Returned
ar: تحديد التأمين كمُعاد
fr: Marquer le dépôt retourné

# bookingKeepDeposit
source: Keep Deposit
ar: الاحتفاظ بالتأمين
fr: Conserver le dépôt

# bookingAlreadyRated
source: You have already rated this booking
ar: لقد قمت بتقييم هذا الحجز مسبقًا
fr: Vous avez déjà noté cette réservation

# bookingRateExperience
source: Rate Your Experience
ar: قيّم تجربتك
fr: Notez votre expérience

# bookingRateQuestion
source: How was your experience with this user?
ar: كيف كانت تجربتك مع هذا المستخدم؟
fr: Comment s'est passée votre expérience avec cet utilisateur ?

# bookingCancel
source: Cancel
ar: إلغاء
fr: Annuler

# bookingSubmit
source: Submit
ar: إرسال
fr: Envoyer

# bookingDaysLabel
source: Days
ar: الأيام
fr: Jours

# bookingTotalCostValue
source: DA {amount}
ar: دج {amount}

# statusPending
source: Pending
ar: قيد الانتظار
fr: En attente

# statusAccepted
source: Accepted
ar: مقبول
fr: Acceptée

# statusDeclined
source: Declined
ar: مرفوض
fr: Refusée

# statusActive
source: Active
ar: نشط

# statusCompleted
source: Completed
ar: مكتمل
fr: Terminée

# statusClosed
source: Closed
ar: مغلق
fr: Clôturée

# depositStatusNone
source: None
ar: لا شيء
fr: Aucun

# depositStatusReceived
source: Received
ar: تم الاستلام
fr: Reçu

# depositStatusReturned
source: Returned
ar: تم الإرجاع
fr: Retourné

# depositStatusKept
source: Kept
ar: تم الاحتفاظ به
fr: Conservé

# mapTitle
source: Map
ar: الخريطة
fr: Carte

# mapServicesDisabled
source: Location services are disabled.
ar: خدمات الموقع معطلة.
fr: Les services de localisation sont désactivés.

# mapPermissionDenied
source: Location permission denied.
ar: تم رفض إذن الموقع.
fr: Autorisation de localisation refusée.

# mapPermissionDeniedForever
source: Location permission permanently denied.
ar: تم رفض إذن الموقع بشكل دائم.
fr: Autorisation de localisation refusée de façon permanente.

# mapCurrentLocationSet
source: Location set to your current position!
ar: تم تعيين الموقع على موقعك الحالي!
fr: Position définie sur votre localisation actuelle !

# mapLocationFailed
source: Failed to get location. Try again.
ar: فشل الحصول على الموقع. حاول مرة أخرى.
fr: Impossible d'obtenir la localisation. Réessayez.

# mapLocalizeCurrent
source: Localize to Current Location
ar: تحديد موقعي الحالي
fr: Me localiser actuellement

# mapConfirmLocation
source: Confirm Location
ar: تأكيد الموقع
fr: Confirmer la localisation

# myListingsTitle
source: My Listings
ar: قوائم عروضى
fr: Mes listes

# myListingsNoItems
source: No listings yet
ar: لا توجد عروض بعد
fr: Aucune liste pour le moment

# myListingsOffline
source: (Offline mode)
ar: (وضع عدم الاتصال)
fr: (Mode hors ligne)

# myListingsOfflineBanner
source: 📡 Offline Mode - Showing cached listings
ar: 📡 وضع عدم الاتصال - عرض القوائم المحفوظة
fr: 📡 Mode hors ligne - Affichage des annonces en cache

# myListingsStatusActive
source: Active
ar: نشط

# myListingsStatusRented
source: Rented
ar: مؤجَّر
fr: Louée

# myListingsStatusPending
source: Pending Approval
ar: بانتظار الموافقة
fr: En attente d'approbation

# myListingsStatusUnavailable
source: Unavailable
ar: غير متاح
fr: Indisponible

# myListingsEdit
source: Edit
ar: تعديل
fr: Modifier

# myListingsView
source: View
ar: عرض
fr: Voir

# myListingsDelete
source: Delete
fr: Supprimer

# myListingsDeleteConfirmTitle
source: Delete Listing
fr: Supprimer l'annonce

# myListingsDeleteConfirmMessage
source: Are you sure you want to delete "{itemTitle}"? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer "{itemTitle}"? Cette action ne peut pas être annulée.

# myListingsDeleteConfirm
source: Delete
fr: Supprimer

# myListingsCancel
source: Cancel
fr: Annuler

# myListingsDeleteSuccess
source: Listing deleted successfully
fr: Annonce supprimée avec succès
