Repository: Mohamedislam19/Sellefli
Catalog: l10n/app_*.arb
Languages: ar, fr

# appTitle
source: Sellefli
ar: سلفلي

# profileTitle
source: Profile
ar: الملف الشخصي

source: Retry
ar: إعادة المحاولة
fr: Réessayer

source: Edit Profile
ar: تعديل الملف الشخصي
fr: Modifier le profile

source: Settings / Help
ar: الإعدادات / المساعدة
fr: Paramètres / Aide

source: Logout
ar: تسجيل الخروج
fr: Se déconnecter

source: Recent Transactions
ar: المعاملات الأخيرة
fr: Transactions récentes

source: No recent transactions
ar: لا توجد معاملات حديثة
fr: Aucune transaction récente

source: Unknown Item
ar: عنصر غير معروف
fr: Article inconnu

# borrowedStatus
source: Borrowed
ar: مستعار
fr: Emprunté

# lentStatus
source: Lent
ar: معار
fr: Prêté

source: No ratings yet
ar: لا توجد تقييمات بعد
fr: Aucune évaluation

# userFallback
source: User
ar: مستخدم
fr: Utilisateur

# currencyDa
source: DA {amount}
ar: دج {amount}

source: Language
ar: اللغة
fr: Langue

# languageEnglish
source: English
ar: الإنجليزية
fr: Anglais

# languageArabic
source: Arabic
ar: العربية
fr: Arabe

# languageFrench
source: French
ar: الفرنسية
fr: Français

# languageDialogTitle
source: Choose language
ar: اختر اللغة
fr: Choisissez la langue

# navHome
source: Home
ar: الرئيسية
fr: Accueil

# navRequests
source: Requests
ar: الطلبات
fr: Demandes

# navListings
source: My Listings
ar: عروضي
fr: Mes listes

# navProfile
source: Profile
ar: الملف

# editProfileSuccess
source: Profile updated successfully.
ar: تم تحديث الملف الشخصي بنجاح.
fr: Profile mis à jour avec succès.

# editProfileImagePickFail
source: Failed to pick image: {error}
ar: فشل اختيار الصورة: {error}
fr: Échec de la sélection de l'image : {error}

# editProfileFullName
source: Full Name
ar: الاسم الكامل
fr: Nom complet

# editProfilePhoneNumber
source: Phone Number
ar: رقم الهاتف
fr: Numéro de téléphone

# editProfileSave
source: Save Changes
ar: حفظ التغييرات
fr: Enregistrer les modifications

# editProfileFieldRequired
source: Please enter your {field}
ar: يرجى إدخال {field}
fr: Veuillez saisir votre {field}

# settingsAboutUs
source: About Us
ar: من نحن
fr: À propos de nous

# settingsAboutSellefliTitle
source: About Sellefli
ar: حول سلفلي
fr: À propos de Sellefli

# settingsAboutSellefliDesc
source: Sellefli is a community-based mobile platform that helps neighbors and campus users rent or borrow everyday items from people nearby. Instead of buying new things, you can share what you already own and earn money while helping others. Sellefli makes local exchanges simple, safe, and trustworthy.
ar: سلفلي منصة مجتمعية تساعد الجيران وطلاب الجامعات على استئجار أو استعارة الأشياء اليومية من الأشخاص القريبين. بدلاً من شراء أشياء جديدة، يمكنك مشاركة ما تملكه وكسب المال مع مساعدة الآخرين. سلفلي تجعل التبادل المحلي بسيطًا وآمنًا وموثوقًا.
fr: Sellefli est une plateforme communautaire qui aide les voisins et les étudiants à louer ou emprunter des objets du quotidien auprès de personnes à proximité. Au lieu d'acheter du neuf, vous pouvez partager ce que vous possédez déjà et gagner de l'argent tout en aidant les autres. Sellefli rend les échanges locaux simples, sûrs et fiables.

# settingsMissionTitle
source: Our Mission
ar: مهمتنا
fr: Notre mission

# settingsMissionDesc
source: Our mission is to make sharing a normal part of everyday life. Sellefli empowers people to save money, reduce waste, and strengthen community connections through a trusted local rental network.
ar: مهمتنا جعل المشاركة جزءًا طبيعيًا من الحياة اليومية. سلفلي تمكّن الناس من توفير المال وتقليل الهدر وتقوية الروابط المجتمعية عبر شبكة تأجير محلية موثوقة.
fr: Notre mission est de faire du partage un réflexe quotidien. Sellefli aide chacun à économiser, réduire le gaspillage et renforcer les liens communautaires via un réseau de location local de confiance.

# settingsHowTitle
source: How It Works
ar: كيف يعمل
fr: Comment ça marche

# settingsHowBrowseTitle
source: Browse:
ar: تصفح:
fr: Parcourir :

# settingsHowBrowseDesc
source: Discover items available for rent near you—from tools and electronics to books and household items.
ar: اكتشف العناصر المتاحة للإيجار بالقرب منك — من الأدوات والإلكترونيات إلى الكتب والأغراض المنزلية.
fr: Découvrez les articles disponibles près de chez vous — des outils et électroniques aux livres et objets du quotidien.

# settingsHowRequestTitle
source: Request:
ar: اطلب:
fr: Demander :

# settingsHowRequestDesc
source: Choose what you need and send a booking request with your preferred dates.
ar: اختر ما تحتاجه وأرسل طلب حجز بالتواريخ التي تفضلها.
fr: Choisissez ce dont vous avez besoin et envoyez une demande de réservation avec vos dates.

# settingsHowConfirmTitle
source: Confirm:
ar: تأكيد:
fr: Confirmer :

# settingsHowConfirmDesc
source: The owner reviews your request and approves it.
ar: يقوم المالك بمراجعة طلبك والموافقة عليه.
fr: Le propriétaire examine et approuve votre demande.

# settingsHowMeetTitle
source: Meet & Exchange:
ar: التقِ وتسلم:
fr: Rencontrer & Échanger :

# settingsHowMeetDesc
source: Arrange a safe meeting point to borrow or rent the item.
ar: نسّق نقطة لقاء آمنة لاستعارة أو استئجار العنصر.
fr: Fixez un point de rencontre sûr pour emprunter ou louer l'article.

# settingsHowReturnTitle
source: Return:
ar: الإرجاع:
fr: Retourner :

# settingsHowReturnDesc
source: Bring the item back on time and rate your experience to build trust in the community.
ar: أعد العنصر في الوقت المحدد وقم بتقييم تجربتك لبناء الثقة في المجتمع.
fr: Rendez l'article à temps et évaluez votre expérience pour renforcer la confiance.

# settingsSupportTitle
source: Support
ar: الدعم

# settingsFaqTitle
source: FAQ
ar: الأسئلة الشائعة

# settingsFaqQ1
source: Is Sellefli free to use?
ar: هل استخدام سلفلي مجاني؟
fr: Sellefli est-il gratuit à utiliser ?

# settingsFaqA1
source: Yes, creating an account and browsing listings are completely free. Later versions may introduce optional premium features for frequent users.
ar: نعم، إنشاء حساب وتصفح القوائم مجاني تمامًا. قد نضيف مزايا مدفوعة اختيارية للمستخدمين الدائمين لاحقًا.
fr: Oui, la création de compte et la navigation sont entièrement gratuites. Des options premium facultatives pour les utilisateurs réguliers pourront être ajoutées plus tard.

# settingsFaqQ2
source: What kind of items can be listed?
ar: ما أنواع العناصر التي يمكن إدراجها؟
fr: Quels types d'articles peuvent être listés ?

# settingsFaqA2
source: Everyday personal items such as tools, books, games, sports gear, electronics, small furniture, and other safe, non-prohibited objects.
ar: العناصر الشخصية اليومية مثل الأدوات والكتب والألعاب والمعدات الرياضية والإلكترونيات والأثاث الصغير والأشياء الآمنة غير المحظورة.
fr: Des objets personnels du quotidien comme outils, livres, jeux, matériel de sport, électronique, petit mobilier et autres objets sûrs non interdits.

# settingsFaqQ3
source: How do I know if a user is trustworthy?
ar: كيف أعرف أن المستخدم موثوق؟
fr: Comment savoir si un utilisateur est fiable ?

# settingsFaqA3
source: Each user profile includes ratings from past exchanges. We also encourage communication before confirming a request.
ar: يحتوي ملف كل مستخدم على تقييمات من التبادلات السابقة. نشجع أيضًا على التواصل قبل تأكيد الطلب.
fr: Chaque profile contient des avis d'échanges passés. Nous encourageons aussi la communication avant de confirmer une demande.

# settingsFaqQ4
source: What happens if an item is damaged or lost?
ar: ماذا لو تلف العنصر أو فُقد؟
fr: Que se passe-t-il si un objet est endommagé ou perdu ?

# settingsFaqA4
source: Sellefli promotes trust-based exchanges. For now, users should discuss conditions before borrowing. Future updates will include optional protection plans and verified user systems.
ar: سلفلي تعزز التبادل القائم على الثقة. حاليًا ينبغي للمستخدمين مناقشة الشروط قبل الاستعارة. سنضيف خطط حماية اختيارية وأنظمة تحقق في التحديثات القادمة.
fr: Sellefli repose sur la confiance. Pour l'instant, discutez des conditions avant l'emprunt. Des plans de protection optionnels et des systèmes d'utilisateurs vérifiés arriveront dans de prochaines mises à jour.

# settingsFaqQ5
source: Can I cancel a request after sending it?
ar: هل يمكنني إلغاء الطلب بعد إرساله؟
fr: Puis-je annuler une demande après l'avoir envoyée ?

# settingsFaqA5
source: Yes, requests can be canceled as long as they haven’t been accepted by the owner. Once accepted, both users should communicate directly to agree on changes.
ar: نعم، يمكن إلغاء الطلبات ما لم يتم قبولها من المالك. بعد القبول، ينبغي للطرفين التواصل مباشرة للاتفاق على أي تغيير.
fr: Oui, tant que la demande n'a pas été acceptée par le propriétaire. Une fois acceptée, discutez directement ensemble pour convenir de changements.

# settingsFaqQ6
source: Is payment handled inside the app?
ar: هل يتم الدفع داخل التطبيق؟
fr: Le paiement se fait-il dans l'application ?

# settingsFaqA6
source: During the first versions, payments and returns are handled manually between users. A secure in-app payment system will be added in future updates.
ar: في الإصدارات الأولى، يتم الدفع والإرجاع يدويًا بين المستخدمين. سنضيف نظام دفع آمن داخل التطبيق في التحديثات المستقبلية.
fr: Dans les premières versions, les paiements et retours sont gérés manuellement entre utilisateurs. Un système de paiement sécurisé in-app sera ajouté ultérieurement.

# settingsFaqQ7
source: How do I contact the Sellefli team?
ar: كيف أتواصل مع فريق سلفلي؟
fr: Comment contacter l'équipe Sellefli ?

# settingsFaqA7
source: You can reach us directly from the “Contact Support” section below.
ar: يمكنك الوصول إلينا من قسم "اتصل بالدعم" أدناه.
fr: Contactez-nous via la section "Contact Support" ci-dessous.

# settingsContactTitle
source: Contact & Support
ar: اتصل بالدعم

# settingsContactDesc
source: 📧 Email: support@sellefli.com 🌐 Website: www.sellefli.dz If you encounter any issue or wish to share feedback, please reach out via email or social media. We respond within 24–48 hours.
ar: 📧 البريد: support@sellefli.com 🌐 الموقع: www.sellefli.dz إذا واجهت أي مشكلة أو رغبت في مشاركة ملاحظاتك، راسلنا عبر البريد أو وسائل التواصل. نرد خلال 24–48 ساعة.
fr: 📧 Email : support@sellefli.com 🌐 Site : www.sellefli.dz Si vous rencontrez un problème ou souhaitez partager un retour, écrivez-nous par email ou sur les réseaux. Nous répondons sous 24–48h.

# settingsLegalTitle
source: Legal & Community
ar: القانون والمجتمع
fr: Légal & Communauté

# settingsCommunityTitle
source: Community Guidelines
ar: إرشادات المجتمع
fr: Règles de la communauté

# settingsCommunityDesc
source: Sellefli is built on trust and respect. Every user contributes to a safe and friendly environment.
ar: سلفلي مبنية على الثقة والاحترام. كل مستخدم يساهم في بيئة آمنة وودية.
fr: Sellefli est fondé sur la confiance et le respect. Chaque utilisateur contribue à un environnement sûr et bienveillant.

# settingsCommunityBullet1
source: Be respectful and reliable.
ar: كن محترمًا وموثوقًا.
fr: Soyez respectueux et fiable.

# settingsCommunityBullet2
source: Communicate clearly.
ar: تواصل بوضوح.
fr: Communiquez clairement.

# settingsCommunityBullet3
source: Avoid last-minute cancellations.
ar: تجنب الإلغاءات في اللحظة الأخيرة.
fr: Évitez les annulations de dernière minute.

# settingsCommunityBullet4
source: Keep your items clean and in good condition.
ar: حافظ على نظافة العناصر وحالتها الجيدة.
fr: Gardez vos articles propres et en bon état.

# settingsTermsTitle
source: Terms and Conditions
ar: الشروط والأحكام
fr: Conditions générales

# settingsTermsIntro
source: By using Sellefli, you agree to:
ar: باستخدام سلفلي، أنت توافق على:
fr: En utilisant Sellefli, vous acceptez de :

# settingsTermsBullet1
source: Share only items that you own or have the right to lend.
ar: شارك فقط العناصر التي تملكها أو لديك الحق في إعارتها.
fr: Partager uniquement les objets que vous possédez ou avez le droit de prêter.

# settingsTermsBullet2
source: Treat borrowed items with care and return them on time.
ar: عامل العناصر المستعارة بعناية وأعدها في الوقت المحدد.
fr: Prendre soin des objets empruntés et les rendre à temps.

# settingsTermsBullet3
source: Communicate honestly and respectfully with other users.
ar: تواصل بصدق واحترام مع المستخدمين الآخرين.
fr: Communiquer honnêtement et respectueusement avec les autres utilisateurs.

# settingsTermsBullet4
source: Avoid prohibited, unsafe, or illegal items.
ar: تجنب العناصر المحظورة أو غير الآمنة أو غير القانونية.
fr: Éviter les objets interdits, dangereux ou illégaux.

# settingsTermsBullet5
source: Report any suspicious or inappropriate behavior to the support team.
ar: أبلغ عن أي سلوك مريب أو غير لائق لفريق الدعم.
fr: Signaler tout comportement suspect ou inapproprié à l'équipe support.

# settingsTermsOutro
source: Sellefli is not responsible for lost or damaged items but provides guidance and tools to help users resolve issues responsibly. Full Terms and Conditions will be available at launch on the official website.
ar: سلفلي غير مسؤولة عن العناصر المفقودة أو التالفة لكنها توفر إرشادات وأدوات لمساعدة المستخدمين على حل المشكلات بمسؤولية. ستتوفر الشروط الكاملة عند الإطلاق على الموقع الرسمي.
fr: Sellefli n'est pas responsable des objets perdus ou endommagés mais fournit des conseils et outils pour aider à résoudre les problèmes de manière responsable. Les CG complètes seront disponibles au lancement sur le site officiel.

# settingsPrivacyTitle
source: Privacy Policy
ar: سياسة الخصوصية
fr: Politique de confidentialité

# settingsPrivacyDesc
source: Sellefli respects your privacy as described in our full policy, available on the official website.
ar: سلفلي تحترم خصوصيتك كما هو موضح في سياستنا الكاملة المتاحة على الموقع الرسمي.
fr: Sellefli respecte votre vie privée comme décrit dans notre politique complète, disponible sur le site officiel.

# settingsFooter
source: App Version 1.0.0 (Beta) © 2025 Sellefli. All rights reserved.
ar: إصدار التطبيق 1.0.0 (بيتا) © 2025 سلفلي. جميع الحقوق محفوظة.
fr: Version de l'app 1.0.0 (Beta) © 2025 Sellefli. Tous droits réservés.

# landingTagline
source: Borrow nearby · Share simply
ar: استعر من القريب · وشارك ببساطة
fr: Empruntez près de chez vous · Partagez simplement

# landingGetStarted
source: Get Started
ar: ابدأ الآن
fr: Commencer

# landingSignIn
source: Sign In
ar: تسجيل الدخول
fr: Se connecter

# landingTerms
source: Terms & Conditions
ar: الشروط والأحكام
fr: Conditions générales

# landingFeatureBrowseTitle
source: Browse Local Items
ar: تصفح العناصر القريبة
fr: Parcourir les articles locaux

# landingFeatureBrowseDescription
source: Discover a wide array of tools, equipment, and unique items available for rent in your neighborhood.
ar: اكتشف مجموعة واسعة من الأدوات والمعدات والعناصر المميزة المتاحة للإيجار في حيك.
fr: Découvrez une large sélection d'outils, d'équipements et d'objets uniques à louer dans votre quartier.

# landingFeatureLendTitle
source: Effortless Lending
ar: إعارة بدون مجهود
fr: Prêt simplifié

# landingFeatureLendDescription
source: List your unused items in minutes and earn while contributing to a sustainable community economy.
ar: أضف العناصر التي لا تستخدمها في دقائق واربح بينما تساهم في اقتصاد محلي مستدام.
fr: Publiez vos objets inutilisés en quelques minutes et gagnez tout en contribuant à une économie locale durable.

# landingFeatureConnectTitle
source: Connect with Neighbors
ar: التواصل مع الجيران
fr: Connectez-vous avec vos voisins

# landingFeatureConnectDescription
source: Build trust and strengthen local ties through shared resources and friendly interactions.
ar: ابنِ الثقة وعزز الروابط المحلية من خلال تقاسم الموارد والتعاملات الودية.
fr: Créez la confiance et renforcez les liens locaux grâce au partage de ressources et aux échanges conviviaux.

# authSignupSuccess
source: Account created successfully! Welcome to Sellefli.
ar: تم إنشاء الحساب بنجاح! مرحبًا بك في سلفلي.
fr: Compte créé avec succès ! Bienvenue sur Sellefli.

# authLoginSuccess
source: Welcome back! Login successful.
ar: مرحبًا بعودتك! تم تسجيل الدخول بنجاح.
fr: Ravi de vous revoir ! Connexion réussie.

# authEmailLabel
source: Email
ar: البريد الإلكتروني

# authPasswordLabel
source: Password
ar: كلمة المرور
fr: Mot de passe

# authPasswordHint
source: Enter your password
ar: أدخل كلمة المرور
fr: Entrez votre mot de passe

# authFullNameLabel
source: Full Name
ar: الاسم الكامل
fr: Nom complet

# authFullNameHint
source: Mohammed Ahmed
ar: محمد أحمد
fr: Mohamed Ahmed

# authPhoneLabel
source: Phone Number
ar: رقم الهاتف
fr: Numéro de téléphone

# authForgotPassword
source: Forgot your password?
ar: نسيت كلمة المرور؟
fr: Mot de passe oublié ?

# authLoginButton
source: Log in
ar: تسجيل الدخول
fr: Se connecter

# authNoAccount
source: Don't have an account?
ar: ليس لديك حساب؟
fr: Pas encore de compte ?

# authRegister
source: Register
ar: إنشاء حساب
fr: S'inscrire

# authLoginTitle
source: Hello again!
ar: مرحبًا مجددًا!
fr: Bon retour !

# authLoginSubtitle
source: Please log in to continue
ar: الرجاء تسجيل الدخول للمتابعة
fr: Veuillez vous connecter pour continuer

# authSignupTitle
source: Create an account
ar: أنشئ حسابًا
fr: Créer un compte

# authSignupSubtitle
source: Join us today
ar: انضم إلينا اليوم
fr: Rejoignez-nous dès aujourd'hui

# authAlreadyAccount
source: Already have an account?
ar: لديك حساب بالفعل؟
fr: Vous avez déjà un compte ?

# authRememberPassword
source: Remember your password?
ar: هل تتذكر كلمة المرور؟
fr: Vous vous souvenez de votre mot de passe ?

# authSendResetLink
source: Send Reset Link
ar: إرسال رابط إعادة التعيين
fr: Envoyer le lien de réinitialisation

# authOr
source: OR
ar: أو
fr: OU

# authResetTitle
source: Reset Password
ar: إعادة تعيين كلمة المرور
fr: Réinitialiser le mot de passe

# authResetSubtitle
source: Enter your email to receive a password reset link
ar: أدخل بريدك الإلكتروني لتلقي رابط إعادة التعيين
fr: Saisissez votre email pour recevoir un lien de réinitialisation

# validateFullNameEmpty
source: Please enter your full name
ar: يرجى إدخال الاسم الكامل
fr: Veuillez entrer votre nom complet

# validateFullNameMin
source: Name must be at least 3 characters
ar: يجب أن يكون الاسم 3 أحرف على الأقل
fr: Le nom doit comporter au moins 3 caractères

# validateFullNameMax
source: Name must not exceed 50 characters
ar: يجب ألا يتجاوز الاسم 50 حرفاً
fr: Le nom ne doit pas dépasser 50 caractères

# validateFullNameChars
source: Name can only contain letters, spaces, hyphens, and apostrophes
ar: يمكن أن يحتوي الاسم فقط على أحرف ومسافات وشرطات وأبوسروفات
fr: Le nom ne peut contenir que des lettres, espaces, tirets et apostrophes

# validatePhoneEmpty
source: Please enter your phone number
ar: يرجى إدخال رقم الهاتف
fr: Veuillez saisir votre numéro de téléphone

# validatePhoneDigits
source: Phone number can only contain digits
ar: رقم الهاتف يمكن أن يحتوي على أرقام فقط
fr: Le numéro de téléphone ne peut contenir que des chiffres

# validatePhoneMin
source: Phone number must be at least 8 digits
ar: يجب أن يحتوي رقم الهاتف على 8 أرقام على الأقل
fr: Le numéro de téléphone doit comporter au moins 8 chiffres

# validateEmailEmpty
source: Please enter your email
ar: يرجى إدخال البريد الإلكتروني
fr: Veuillez saisir votre e-mail

# validateEmailInvalid
source: Please enter a valid email address
ar: يرجى إدخال بريد إلكتروني صالح
fr: Veuillez saisir une adresse e-mail valide

# validatePasswordEmpty
source: Please enter your password
ar: يرجى إدخال كلمة المرور
fr: Veuillez saisir votre mot de passe

# validatePasswordNoSpaces
source: No spaces allowed
ar: المسافات غير مسموحة
fr: Aucun espace autorisé

# validatePasswordMin
source: Min 8 characters required
ar: مطلوب 8 أحرف على الأقل
fr: Minimum 8 caractères requis

# validatePasswordUpper
source: Add at least 1 uppercase letter
ar: أضف حرفاً كبيراً واحداً على الأقل
fr: Ajoutez au moins 1 lettre majuscule

# validatePasswordLower
source: Add at least 1 lowercase letter
ar: أضف حرفاً صغيراً واحداً على الأقل
fr: Ajoutez au moins 1 lettre minuscule

# validatePasswordNumber
source: Add at least 1 number
ar: أضف رقماً واحداً على الأقل
fr: Ajoutez au moins 1 chiffre

# validatePasswordSpecial
source: Add at least 1 special character
ar: أضف رمزاً خاصاً واحداً على الأقل
fr: Ajoutez au moins 1 caractère spécial

# validateLoginPasswordEmpty
source: Please enter your password
ar: يرجى إدخال كلمة المرور
fr: Veuillez saisir votre mot de passe

# homeExploreTitle
source: Explore
ar: استكشف
fr: Explorer

# homeError
source: Error loading items
ar: خطأ في تحميل العناصر
fr: Erreur lors du chargement des articles

# homeEmpty
source: No items found
ar: لا توجد عناصر
fr: Aucun article trouvé

# homeOfflineTitle
source: You are currently offline
ar: أنت غير متصل حالياً
fr: Vous êtes actuellement hors ligne

# homeOfflineSubtitle
source: Connect to the internet to see more items
ar: اتصل بالإنترنت لرؤية المزيد من العناصر
fr: Connectez-vous à internet pour voir plus d'articles

# homeLocationPlaceholder
source: Location
ar: الموقع
fr: Localisation

source: {distance} km
ar: {distance} كم

# homeRadiusLabel
source: Radius
ar: نطاق
fr: Rayon

# homeSearchHint
source: Search for items...
ar: ابحث عن عناصر...
fr: Rechercher des articles...

# homeUseLocation
source: Use my location
ar: استخدم موقعي
fr: Utiliser ma position

# categoryAll
source: All
ar: الكل
fr: Tous

# categoryElectronicsTech
source: Electronics & Tech
ar: الإلكترونيات والتقنية
fr: Électronique & Tech

# categoryHomeAppliances
source: Home & Appliances
ar: المنزل والأجهزة
fr: Maison & Électroménager

# categoryFurnitureDecor
source: Furniture & Décor
ar: الأثاث والديكور
fr: Meubles & Décoration

# categoryToolsEquipment
source: Tools & Equipment
ar: الأدوات والمعدات
fr: Outils & Équipements

# categoryVehiclesMobility
source: Vehicles & Mobility
ar: المركبات والتنقل
fr: Véhicules & Mobilité

# categorySportsOutdoors
source: Sports & Outdoors
ar: الرياضة والهواء الطلق
fr: Sports & Plein air

# categoryBooksStudy
source: Books & Study
ar: الكتب والدراسة
fr: Livres & Études

# categoryFashionAccessories
source: Fashion & Accessories
ar: الموضة والإكسسوارات
fr: Mode & Accessoires

# categoryEventsCelebrations
source: Events & Celebrations
ar: الفعاليات والمناسبات
fr: Événements & Célébrations

# categoryBabyKids
source: Baby & Kids
ar: الأطفال والرضع
fr: Bébé & Enfants

# categoryHealthPersonal
source: Health & Personal Care
ar: الصحة والعناية الشخصية
fr: Santé & Soins personnels

# categoryMusicalInstruments
source: Musical Instruments
ar: الآلات الموسيقية
fr: Instruments de musique

# categoryHobbiesCrafts
source: Hobbies & Crafts
ar: الهوايات والحرف
fr: Loisirs & Artisanat

# categoryPetSupplies
source: Pet Supplies
ar: مستلزمات الحيوانات
fr: Fournitures pour animaux

# categoryOther
source: Other Items
ar: عناصر أخرى
fr: Autres articles

# itemCreateTitle
source: Create Item
ar: إنشاء عنصر
fr: Créer un article

# itemEditTitle
source: Edit Item
ar: تعديل العنصر
fr: Modifier l'article

source: Item Photos
ar: صور العنصر
fr: Photos de l'article

# itemGallery
source: Gallery
ar: المعرض
fr: Galerie

# itemCamera
source: Camera
ar: الكاميرا
fr: Appareil photo

# itemImageLimit
source: You can upload up to {max} images.
ar: يمكنك رفع ما يصل إلى {max} صور.
fr: Vous pouvez télécharger jusqu'à {max} images.

# itemImageRequired
source: At least one photo is required.
ar: يجب إضافة صورة واحدة على الأقل.
fr: Au moins une photo est requise.

# itemTitleLabel
source: Title
ar: العنوان
fr: Titre

# itemTitleHint
source: e.g., Electric Drill, Bicycle
ar: مثال: مثقاب كهربائي، دراجة
fr: ex. Perceuse électrique, Vélo

# itemCategoryLabel
source: Category
ar: الفئة
fr: Catégorie

# itemDescriptionLabel
source: Description
ar: الوصف

# itemDescriptionHint
source: Describe your item in detail...
ar: صف العنصر بالتفصيل...
fr: Décrivez votre article en détail...

# itemValuePerDayLabel
source: Estimated Value per Day
ar: القيمة التقديرية في اليوم
fr: Valeur estimée par jour

# itemValueLabel
source: Estimated Value
ar: القيمة التقديرية
fr: Valeur estimée

# itemValueHint
source: e.g., 150 DA
ar: مثال: 150 دج
fr: ex. 150 DA
